app/Models/ModelAgenda.php

    public function getAgenda()
    {
        $builder = $this->db->table('tbl_agenda');
        return $builder->get();
---
SELECT *
FROM `tbl_agenda`

    public function insertData($data)
    {
        $this->db->table('tbl_agenda')->insert($data);
---
INSERT INTO `tbl_agenda` (`id_agenda`, `namakegiatan`, `tgl`, `jam`) VALUES ('P-006', 'Tabligh Akbar', '2023-12-03', '07:00')