app/Models/ModelKasKeluar.php

    public function deleteKaskeluar($id)
    {
        $query = $this->db->table('tbl_kas_keluar')->delete(['id_kaskeluar' => $id]);
---
DELETE FROM `tbl_kas_keluar`
WHERE `id_kaskeluar` = '1'