app/Models/ModelPengurus.php

SELECT *
FROM `tbl_pengurus`
---
    public function getPengurus()
    {
        $builder = $this->db->table('tbl_pengurus');
        return $builder->get();

UPDATE `tbl_pengurus` SET `nama_pengurus` = 'Yakub', `jabatan` = 'Wakil Ketua', `alamat` = 'Mega V', `no_hp` = '082282316313'
WHERE `id_pengurus` = 'P-0002'
---
    public function updateData($data,$id)
    {
        $query = $this->db->table('tbl_pengurus')->update($data, ['id_pengurus' => $id]);