app/Models/ModelKasMasuk.php

    public function getKasmasuk()
    {
        // $builder = $this->db->table('tbl_kas_masjid')->where('status = "Masuk"');
        $builder = $this->db->table('tbl_kas_masjid');
        $builder->select('id_kas_masjid,tanggal,iddonatur,nama,ket,kas_masuk,jenis_kas');
        $builder->join('tbl_donatur', 'tbl_kas_masjid.iddonaturmasjid = tbl_donatur.iddonatur');
        // $builder->where('status = "Masuk"');
        // $query = $builder->get();
        // $builder = $this->db->query("select * from tbl_kas_masjid where tanggal >= '$tgla' and tanggal <= '$tglb' and jenis_kas ='$jenis' and status ='masuk'");
        return $builder->get();
---
SELECT `id_kas_masjid`, `tanggal`, `iddonatur`, `nama`, `ket`, `kas_masuk`, `jenis_kas`
FROM `tbl_kas_masjid`
JOIN `tbl_donatur` ON `tbl_kas_masjid`.`iddonaturmasjid` = `tbl_donatur`.`iddonatur`

    public function deleteKasMasuk($id)
    {
        $query = $this->db->table('tbl_kas_masjid')->delete(['id_kas_masjid' => $id]);
---
DELETE FROM `tbl_kas_masjid`
WHERE `id_kas_masjid` = '3'

    public function getDonatur()
    {
        $builder = $this->db->table('tbl_donatur');
        return $builder->get();
---
SELECT *
FROM `tbl_donatur`