app/Models/ModelDonatur.php

    public function getDonatur()
    {
        $builder = $this->db->table('tbl_donatur');
        return $builder->get();
---
SELECT *
FROM `tbl_donatur`